# UN Data Analysis Project

Analysis on UN Data comparingh gdp per capita and internet usage

# Import Library

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Formatting

In [2]:
%matplotlib inline

# Load Data

In [3]:
gdp_df = pd.read_csv('../data/gdp_percapita.csv', error_bad_lines = False)

In [4]:
gdp_df.head(6)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2018  1734.723214              NaN
1     Afghanistan  2017  1758.465636              NaN
2     Afghanistan  2016  1757.023490              NaN
3     Afghanistan  2015  1766.593077              NaN
4     Afghanistan  2014  1795.735834              NaN
5     Afghanistan  2013  1807.762344              NaN

In [5]:
internet_df = pd.read_csv('../data/internet_use.csv', error_bad_lines = False)

b'Skipping line 4675: expected 4 fields, saw 6\n'

In [6]:
internet_df.head(6)

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN
5     Afghanistan  2009  3.550000              NaN

In [7]:
gdp_df.shape

(6731, 4)

In [8]:
internet_df.shape

(4675, 4)

In [9]:
print(type(gdp_df))

<class 'pandas.core.frame.DataFrame'>

In [10]:
gdp_df.dtypes

Country or Area     object
Year                object
Value              float64
Value Footnotes    float64
dtype: object

In [11]:
internet_df.dtypes

Country or Area     object
Year                object
Value              float64
Value Footnotes    float64
dtype: object

In [12]:
gdp_df.tail(10)

,Country or Area,Year,Value,Value Footnotes
6721,Zimbabwe,1997,3036.422224,NaN
6722,Zimbabwe,1996,2985.856605,NaN
6723,Zimbabwe,1995,2736.486436,NaN
6724,Zimbabwe,1994,2768.309953,NaN
6725,Zimbabwe,1993,2572.870395,NaN
6726,Zimbabwe,1992,2591.007534,NaN
6727,Zimbabwe,1991,2906.272849,NaN
6728,Zimbabwe,1990,2819.549467,NaN
6729,footnoteSeqID,Footnote,NaN,NaN
6730,2,"Excludes South Sudan after July 9, 2011.",NaN,NaN

In [13]:
internet_df.tail(10)

,Country or Area,Year,Value,Value Footnotes
4665,170,Refers to the total population.,NaN,NaN
4666,171,Internet Dial-up customers.,NaN,NaN
4667,172,Population age 16+ using the Internet in the l...,NaN,NaN
4668,173,Population age 16+ using internet in the last ...,NaN,NaN
4669,174,"U.S. Census Bureau, Table 2. Reported Internet...",NaN,NaN
4670,175,Includes individuals 3 years and older,NaN,NaN
4671,176,NTIA/CPS survey.,NaN,NaN
4672,178,Estimated based on Survey's results. Populatio...,NaN,NaN
4673,179,Preliminary. Country estimate.,NaN,NaN
4674,180,The methodology used to estimated the figure f...,NaN,NaN

In [14]:
del internet_df['Value Footnotes']

In [15]:
del gdp_df['Value Footnotes']

In [16]:
gdp_df.head(5)

  Country or Area  Year        Value
0     Afghanistan  2018  1734.723214
1     Afghanistan  2017  1758.465636
2     Afghanistan  2016  1757.023490
3     Afghanistan  2015  1766.593077
4     Afghanistan  2014  1795.735834

In [17]:
internet_df.head(5)

  Country or Area  Year     Value
0     Afghanistan  2014  6.390000
1     Afghanistan  2013  5.900000
2     Afghanistan  2012  5.454545
3     Afghanistan  2011  5.000000
4     Afghanistan  2010  4.000000

In [18]:
gdp_df.columns = ['Country','Year','GDP_Per_Capita']

In [19]:
gdp_df.head(5)

       Country  Year  GDP_Per_Capita
0  Afghanistan  2018     1734.723214
1  Afghanistan  2017     1758.465636
2  Afghanistan  2016     1757.023490
3  Afghanistan  2015     1766.593077
4  Afghanistan  2014     1795.735834

In [20]:
internet_df.columns = ['Country','Year','Internet_Users_Pct']

In [21]:
internet_df.head(5)

       Country  Year  Internet_Users_Pct
0  Afghanistan  2014            6.390000
1  Afghanistan  2013            5.900000
2  Afghanistan  2012            5.454545
3  Afghanistan  2011            5.000000
4  Afghanistan  2010            4.000000

In [22]:
gdp_and_internet_use = gdp_df.merge(internet_df)

In [23]:
gdp_and_internet_use.head(5)

       Country  Year  GDP_Per_Capita  Internet_Users_Pct
0  Afghanistan  2014     1795.735834            6.390000
1  Afghanistan  2013     1807.762344            5.900000
2  Afghanistan  2012     1772.764974            5.454545
3  Afghanistan  2011     1626.764793            5.000000
4  Afghanistan  2010     1671.581238            4.000000

In [24]:
gdp_and_internet_use.tail(5)

            Country      Year  GDP_Per_Capita  Internet_Users_Pct
3515       Zimbabwe      1996     2985.856605            0.016790
3516       Zimbabwe      1995     2736.486436            0.007684
3517       Zimbabwe      1994     2768.309953            0.001739
3518       Zimbabwe      1990     2819.549467            0.000000
3519  footnoteSeqID  Footnote             NaN                 NaN

In [25]:
gdp_df.tail(5)

            Country                                      Year  GDP_Per_Capita
6726       Zimbabwe                                      1992     2591.007534
6727       Zimbabwe                                      1991     2906.272849
6728       Zimbabwe                                      1990     2819.549467
6729  footnoteSeqID                                  Footnote             NaN
6730              2  Excludes South Sudan after July 9, 2011.             NaN

In [26]:
internet_df.tail(5)

,Country,Year,Internet_Users_Pct
4670,175,Includes individuals 3 years and older,NaN
4671,176,NTIA/CPS survey.,NaN
4672,178,Estimated based on Survey's results. Populatio...,NaN
4673,179,Preliminary. Country estimate.,NaN
4674,180,The methodology used to estimated the figure f...,NaN